app/controllers/accounts_controller.rb

  def update_accounts
    account_balances_arry = Account.get_account_balances_arry
    if account_balances_arry.sum.to_f != params["amount"].to_f
      balance_hash = get_balance_accounts(account_balances_arry.reverse, params["amount"].to_f)
      accounts = Account.where("balance in (?)", balance_hash.keys)
      accounts.each do |acnt|
        acnt.balance = acnt.balance - balance_hash[acnt.balance]
        acnt.save!
      end
    else
      Account.all.update_all("balance = ?", 0.0)
    end
    @accounts = Account.all
---
SELECT "accounts".* FROM "accounts" WHERE (balance = 20000.0) ORDER BY "accounts"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE (balance = 15000.0) ORDER BY "accounts"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE (balance in (25000.0,15000.0,12000.0,10000.0))
UPDATE "accounts" SET "balance" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["balance", 1.0], ["updated_at", "2022-02-06 13:03:14.093228"], ["id", 7]]
SELECT "accounts".* FROM "accounts" WHERE (balance = 25000.0 or balance = 10000.0 or balance = 5000.0)
SELECT "accounts".* FROM "accounts" WHERE (balance = 25000.0) ORDER BY "accounts"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def get_balance_accounts(array, sum)
    rem_amt = sum
    a = {}
    array.each do |amt|
      next if rem_amt == 0.0
      if rem_amt >= amt
        if array.include?(rem_amt).blank?
          a[amt] = amt
          rem_amt -= amt
        else
          a[rem_amt] = rem_amt
          rem_amt -= rem_amt
        end
      else
        closest_amt = get_closest_amount(Account.get_account_balances_arry, rem_amt)
        if array.include?(rem_amt).blank?
          if closest_amt.present?
---
SELECT "accounts".* FROM "accounts" WHERE (balance = 5000.0) ORDER BY "accounts"."id" ASC LIMIT ?  [["LIMIT", 1]]