app/models/account.rb

SELECT "accounts"."balance" FROM "accounts"
---
  def self.get_account_balances_arry
    Account.all.pluck("balance").sort