app/views/accounts/_accounts_data.html.erb

SELECT "accounts".* FROM "accounts" WHERE (balance = 222.0) ORDER BY "accounts"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
<div id='accounts_div'>
  <%= hidden_field_tag "max_balance_amt",  Account.get_account_balances_arry.sum%>